{
    "backend": "theano",
    "keras_version": "2.0.6",
    "config": [
        {
            "config": {
                "kernel_regularizer": null,
                "name": "dense_1",
                "kernel_constraint": null,
                "activity_regularizer": null,
                "use_bias": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "activation": "relu",
                "trainable": true,
                "bias_constraint": null,
                "kernel_initializer": {
                    "config": {
                        "mean": 0.0,
                        "seed": null,
                        "stddev": 0.05
                    },
                    "class_name": "RandomNormal"
                },
                "units": 8,
                "batch_input_shape": [
                    null,
                    8
                ],
                "dtype": "float32"
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "kernel_regularizer": null,
                "name": "dense_2",
                "kernel_constraint": null,
                "activity_regularizer": null,
                "use_bias": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "activation": "relu",
                "trainable": true,
                "bias_constraint": null,
                "kernel_initializer": {
                    "config": {
                        "mean": 0.0,
                        "seed": null,
                        "stddev": 0.05
                    },
                    "class_name": "RandomNormal"
                },
                "units": 392
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "kernel_regularizer": null,
                "name": "dense_3",
                "kernel_constraint": null,
                "activity_regularizer": null,
                "use_bias": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "activation": "relu",
                "trainable": true,
                "bias_constraint": null,
                "kernel_initializer": {
                    "config": {
                        "mean": 0.0,
                        "seed": null,
                        "stddev": 0.05
                    },
                    "class_name": "RandomNormal"
                },
                "units": 392
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "kernel_regularizer": null,
                "name": "dense_4",
                "kernel_constraint": null,
                "activity_regularizer": null,
                "use_bias": true,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "activation": "sigmoid",
                "trainable": true,
                "bias_constraint": null,
                "kernel_initializer": {
                    "config": {
                        "mean": 0.0,
                        "seed": null,
                        "stddev": 0.05
                    },
                    "class_name": "RandomNormal"
                },
                "units": 1
            },
            "class_name": "Dense"
        }
    ],
    "class_name": "Sequential"
}